
Процедура _ЗаявкиВСлужбуНСИПриПроведенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.СтатусЗаявки=Перечисления._СтатусыЗаявокВСлужбуНСИ.Новая тогда
		
	  Попытка	
		ЗаписатьЗаявку=РегистрыСведений._ЗаявкиВСлужбуНСИ.СоздатьМенеджерЗаписи();
		ЗаписатьЗаявку.Заявка=Источник.Ссылка;
		ЗаписатьЗаявку.Записать();  
	  Исключение  
		ЗаписьЖурналаРегистрации("Данные.Изменение", 
        УровеньЖурналаРегистрации.Ошибка,
        Метаданные.РегистрыСведений._ЗаявкиВСлужбуНСИ,
        Источник,
        "Не удалось зарегистрировать к обмену"); 
	  КонецПопытки;	
	
	КонецЕсли;	
КонецПроцедуры
